---
kind: method
id: M:Autodesk.Revit.UI.Macros.DocumentEntryPoint.FinishInitializationEO
source: html/21510673-6eb3-1e07-a5ba-0e61d2f68986.htm
---
# Autodesk.Revit.UI.Macros.DocumentEntryPoint.FinishInitializationEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void FinishInitializationEO()
```